SCRIPTS=/home/ivn/scripts/

 case "$1" in
  
    "1" | "01")
    echo "первого"
    ;;
    "2" | "02" )
    echo "второго"
    ;;
    "3" | "03" )
    echo "третьего"
    ;;
    "4" | "04" )
    echo "четвертого"
    ;;
    "5" | "05" )
    echo "пятого"
    ;;
    "6" | "06" )
    echo "шестого"
    ;;
    "7" | "07" )
    echo "седьмого"
    ;;
    "8" | "08" )
    echo "восьмого"
    ;;
    "9" | "09" )
    echo "девятого"
    ;;
    "10" )
    echo "десятого"
    ;;
    "11" )
    echo "одиннадцатого"
    ;;
    "12" )
    echo "двенадцатого"
    ;;
    * )
    
    a="$(${SCRIPTS}number2text_ru.sh male $1 )"
    a=${a//ь/ого}
    echo "$a"
    ;;
    
esac